charliermarsh.ruff
davidanson.vscode-markdownlint
dbcode.dbcode
docker.docker
donjayamanne.githistory
donjayamanne.python-environment-manager
eamodio.gitlens
editorconfig.editorconfig
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
gruntfuggly.todo-tree
marp-team.marp-vscode
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-edgedevtools.vscode-edge-devtools
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.flake8
ms-python.mypy-type-checker
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.copilot-mermaid-diagram
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-speech
ms-vscode.vscode-websearchforcopilot
ms-windows-ai-studio.windows-ai-studio
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
vsls-contrib.gistfs
wallabyjs.console-ninja
wallabyjs.wallaby-vscode
